README.md

# Table of Contents

1.  [Project Description](#orgd01517a)



<a id="orgd01517a"></a>

# Project Description

Primitive web server in python that can serve static files (html, css, and images) and can handle base HTTP GET requests. The server needs to be able to handle multiple simultaneous requests and to provide appropriate responses to the client.

This project is a submission to my undergrad course of Network Programming at Unibo.

